app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def show
   @location = Location.find(params[:id])
   @ll = @location.longitude.to_s + ","+ @location.latitude.to_s
   @venues = foursquare.venues.search(:query => @location.venue, :ll => @ll)