app/controllers/locations_controller.rb

  def show
   @location = Location.find(params[:id])
---
SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 37.2997029) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -122.0034684) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 37.2997029 AND locations.longitude >= -122.0034684) THEN 45.0 WHEN (locations.latitude < 37.2997029 AND locations.longitude >= -122.0034684) THEN 135.0 WHEN (locations.latitude < 37.2997029 AND locations.longitude < -122.0034684) THEN 225.0 WHEN (locations.latitude >= 37.2997029 AND locations.longitude < -122.0034684) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 37.15497111688915 AND 37.44443468311085 AND locations.longitude BETWEEN -122.18541187753821 AND -121.82152492246179 AND locations.id != 4) ORDER BY distance ASC

  def create
    @location = Location.new(params[:location])
    @client = GooglePlaces::Client.new("AIzaSyCbq5JAKHry5HROLhySw3r2BCIkPBlG5cc")
    @location.places = @client.spots(@location.latitude, @location.longitude)
    puts @location.places
    if @location.save
---
INSERT INTO "locations" ("address", "created_at", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "Eiffel Tower"], ["created_at", Sun, 05 Jan 2014 21:15:33 UTC +00:00], ["latitude", 48.8582285], ["longitude", 2.2943877], ["updated_at", Sun, 05 Jan 2014 21:15:33 UTC +00:00]]
INSERT INTO "places" ("address", "created_at", "location_id", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", nil], ["created_at", Thu, 09 Jan 2014 09:35:35 UTC +00:00], ["location_id", 8], ["name", "Caffe Mediterraneum"], ["phone", nil], ["updated_at", Thu, 09 Jan 2014 09:35:35 UTC +00:00]]

  def update
    @location = Location.find(params[:id])
    if @location.update_attributes(params[:location])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "locations" SET "places" = '', "updated_at" = '2014-01-09 07:58:12.042664' WHERE "locations"."id" = 12

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 4]]