app/controllers/sessions_controller.rb

	def create
  		auth = request.env["omniauth.auth"]
  		user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 06 Jan 2014 02:39:15 UTC +00:00], ["name", nil], ["provider", "foursquare"], ["uid", "75270790"], ["updated_at", Mon, 06 Jan 2014 02:39:15 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'foursquare' AND "users"."uid" = '75270790' LIMIT 1